package main

import "fmt"

/*
进制之间转换
*/
func main() {
	othersToTenScale()
	tenScaleToOthers()
}

//其他进制转十进制
func othersToTenScale() {
	//二进制转十进制规则：从最低位开始，将每位上的数取出来，乘以2的位数-1次方
	//1011 = 1 * 2 * 0 + 1 * 2 + 0 * 2 * 2 + 1 * 2 * 2 * 2
	fmt.Printf("11的二进制数为： %b\n", 11)
	//八进制转十进制规则：从最低位开始，将每位上的数取出来，乘以8的位数-1次方(八进制是以0开头)
	fmt.Printf("123的八进制数为：%o\n", 123)
	//十六进制同理
}
func tenScaleToOthers() {
	//十进制转二进制规则：将该数不断地除以二，知道商为零为止，将每步得到的余数倒过来，
	//八进制、十六进制同理
	fmt.Printf("%o\n", 156)
}
func othersToOthers() {
	//二进制转八进制规则：将二进制数每三位一组从低位开始组合，转成对应的八进制数即可
	//二进制转十六进制规则：将二进制数每四位一组从低位开始组合，转成对应的十六进制数
	//八进制转二进制规则：将八进制数每一位转成对应的三位二进制数
	//十六进制转二进制规则：将十六进制数每一位转成对应的四位二进制数
}
